gmail_01_見取り図/20221020_gmail.org
#+SETUPFILE: ~/.emacs.d/org-html-themes/theme-readtheorg.setup
#+OPTIONS:   H:3 num:t toc:3

#+TITLE: gmail、その1
#+DATE: ～梨下村塾～ @令和4（2022）年10月20日
#+AUTHOR: 早川 剛(a.k.a. HAYATUYO)
#+EMAIL: hayakawa_tuyosi_work@yahoo.co.jp
#+LANGUAGE:  ja-jp

# (setq org-html-validation-link nil)

* メールを中心とした世界観

*メールは世界との窓口（interface）*

仕事では報連相のコミュニケーションが大切と言われます。
最近はチャットツールも増えてきましたが、口頭以外の手段では、
コミュニケーションで最も多く使われているのはメールではないでしょうか。

メールを受信し、タスクが発生し、
カレンダーに予定を入れ、
タスクをこなす中で、報連相のメールを送信する。

そのような作業を日々繰り返されていると思います。

googleのサービス群でも、メールサービスであるgmail（google mail）は重要な位置を占めており、
メールからカレンダーへ、またはメールからTODOリストへ、さらにはメールからメモ（google Keep）へと
流れるように行き来でき、僕たちの仕事の付加価値向上に寄与しています。

#+begin_example
ちょっとウソをつきました...
- 行き来のショートカットキーは貧困。マウス頼り。
  - いちおう「C-A-.」で受信ボックスから画面右端のカレンダーなどへ行ける。
  - 双方向性はない。画面右端から受信ボックスにキーボードでは戻ってこれない。
#+end_example

とはいえ、メールがコミュニケーションの窓口であることは確かであり、
以下のようなミスを防げるので、何回かに分けて、gmailの基本操作を学んでいきたいと思います。

- タスクの漏れ、または期日の失念
- 未読のままでのメッセージの放置
  - そもそも受信に気が付かないことも！！

* 予定
- アーカイブ機能
- 検索
  - 検索演算子
  - 検索結果の中の特定のスレッドから検索結果の一覧に戻る方法
- ラベルとフィルター
  - ラベルとは？
    - ラベル名のコツ
  - フィルターとは？
  - 自動ラベル設定
- 他のgoogleサービスとの連携
  - カレンダー
  - TODOリスト
  - メモ（google keep）

* 「アーカイブ」とは？

** アーカイブ機能の客観情報

- 見えなくする。
- 削除されるわけではない。
- 検索結果には現れる。

** メール（スレッド）との付き合い方

*済んだタスクのスレッドはアーカイブし、inobxも心もスッキリさせる !*

inbox にスレッドがたくさんあると...
- 探すのが大変。
- ストレスになる。

*** 手順

1. メッセージを受信する（自動）
2. "todo/undone" ラベルを付ける
   - [[フィルタとラベル][ラベルについては後述します]]
3. タスクを完了させる
4. "todo/done" ラベルを付ける（"todo/undone" ラベルを剥がす）
5. アーカイブする


* ショートカットキー

たくさんありすぎる。
マウスも結構使ってる by 早川

** 移動

| 機能                                                              | キー |
| スレッド間 / 新しいスレッドへ                                     | k    |
| スレッド間 / 古いスレッドへ                                       | j    |
| スレッド内 / 新しいメッセージへ                                   | n    |
| スレッド内 / 古いメッセージへ                                     | p    |
| スレッド内 / スレッド全体を展開する（全てのメッセージを表示する） | ;    |
| スレッド内 / スレッド全体を折りたたむ                             | :    |
| 検索結果 や スレッドリストに戻る                                  | u    |
| 検索フォームにカーソルを移す（検索を始める）                      | /    |

** スレッドの操作

| 機能                                                  | キー       |                                                                  |
| スレッドの選択 / カーソルの当たっているスレッドの選択 | x          |                                                                  |
| スレッドの選択 / 全てのスレッド                       | [*, a]     | 表示されている全てのスレッドや、検索結果の全てのスレッドの全選択 |
| スレッドの選択 / 選択を解除する                       | [*, n]     |                                                                  |
| アーカイブ                                            | e          |                                                                  |
| （選択されている）スレッドを開く                      | o          |                                                                  |
| 返信                                                  | r          |                                                                  |
| 転送                                                  | f          |                                                                  |
| 送信                                                  | ctrl-enter |                                                                  |


| 機能                          | キー |
| [その他の操作] メニューを開く | .    |
| ツールバーにフォーカスする    | ,    |

** 移動（概念）

| 機能                       | キー   | 覚え方                                                                         |
| メールの "メイン" ボックス | [g, i] | i は inbox の頭文字                                                            |
| 下書き                     | [g, d] | d は draft の頭文字                                                            |
| 送信済み                   | [g, t] | （早川流の強引な関連付け）t は tranfer の 頭文字。 または sent の 末尾の文字。 |
|                            |        | なお、[g, s] は「スター付きのメールの一覧」に割り当てられています。            |


** 移動（高次概念）

| 機能                                                            | キー    |                  |
| チャットへ                                                      | [h, c]  |                  |
| [ToDo リスト] に移動                                            | [g, k]  | 正直、使ってない |
| カレンダー、Keep、ToDo リストのサイドバーと受信トレイを切り替え | C-A-.   | 正直、使ってない |
| ToDo リストにスレッドを追加                                     | Shift+t | 正直、使ってない |


* 検索
* フィルタとラベル
